Tekla.Structures.ModelInternal.BimModelDataProduct.DTO.ModelVersionInitDto
Represents the payload to create a new BIM model.

Tekla.Structures.ModelInternal.BimModelDataProduct.DTO.ModelVersionInitDto.BaseVersionId
Gets or sets the base vesion Id.

Tekla.Structures.ModelInternal.BimModelDataProduct.DTO.ModelVersionInitDto.SchemaVersion
Gets or sets the schema version of the model.

Tekla.Structures.ModelInternal.BimModelDataProduct.DTO.ModelVersionInitDto.VersionName
Gets or sets the user-friendly name of the version.

Tekla.Structures.ModelInternal.BimModelDataProduct.DTO.ModelVersionInitDto.Format
Gets or sets the format of the model.

Tekla.Structures.ModelInternal.BimModelDataProduct.DTO.ModelVersionInitDto.Author
Gets or sets the author information as key-value pairs.
Remarks:
This metadata is for display and reference purposes only.
It does not affect access control or ownership, and no verification is performed.
For optimal compatibility with certain applications, please use the recommended keys to ensure proper integration
- authorDisplayName: The display name of the user who created the version.
- organizationDisplayName: The display name of the organization associated with the version.

Tekla.Structures.ModelInternal.BimModelDataProduct.DTO.ModelVersionInitDto.Comment
Gets or sets an optional comment for the model.